const axios = require('axios')
var fs = require('fs');

const getData = async (page) => {
    let {data} = await axios.get(`https://quranwbw.com/assets/data/${page}/word-translations/arabic.json?v=30`)
    let sura  = Object.values(data)?.map(d => {
        return {
            words: d.split("//")?.map(d => {
                return {
                    a: d.split("/")[1],
                    p: d.split("/")[2]
                }
            })
        }
    })
    let {data: translation} = await axios.get(`https://quranwbw.com/assets/data/${page}/word-translations/bangla.json?v=30`)
    Object.values(translation).forEach((translation, index) => {
        translation.split("//")?.forEach((translation, index2) => {
            sura[index].words[index2]['b'] = translation
        })
    })
    const {data: bangla} = await axios.get(`https://quranwbw.com/assets/data/${page}/ayah-translations/bn.muhiuddin.json?v=30`)
    Object.values(bangla).forEach((translation, index) => {
        sura[index].translation = translation
    })
    let surahArray = []
    while(sura.length) {
        surahArray.push(sura.splice(0,10));
    }
    return surahArray
}


(async () => {
    let names = `১। আল- ফাতিহা (সূচনা)
২। আল-বাকারা (বকনা-বাছুর)
৩। আল-ইমরান (ইমরানের পরিবার)
৪। নিসা (নারী)
৫। আল-মায়িদাহ (খাদ্য পরিবেশিত টেবিল)
৬। আল-আনাম (গৃহপালিত পশু)
৭। আল-আরাফ (উচু স্থানসমূহ)
৮। আল-আনফাল (যুদ্ধে-লব্ধ ধনসম্পদ)
৯। আত-তাওবাহ (অনুশোচনা)
১০। ইউনুস (একজন নবী)
১১। হুদ (একজন নবী)
১২। ইউসুফ (একজন নবী)
১৩। আর-রাদ (বজ্রনাদ)
১৪। ইবরাহীম (একজন নবী)
১৫। আল-হিজর (পাথুরে পাহাড়)
১৬। আন-নাহল (মৌমাছি)
১৭। বনি ইসরাইল (ইহুদী জাতি)
১৮। আল-কাহফ (গুহা)
১৯। মারিয়াম (নবী ঈসা(আঃ) এর মা)
২০। ত্বা হা (ত্বা হা)
২১। আল-আম্বিয়া (নবীগণ)
২২। আল-হাজ্ব (হজ্ব)
২৩। আল-মুমিনুন (মুমিনগণ)
২৪। আন-নূর (আলো)
২৫। আল-ফুরকান (সত্য মিথ্যার পার্থক্য নির্ধারণকারী গ্রম্থ)
২৬। আশ-শুআরা (কবিগণ)
২৭। আন-নমল (পিপীলিকা)
২৮। আল-কাসাস (কাহিনী)
২৯। আল-আনকাবুত (মাকড়সা)
৩০। আল-রুম (রোমান জাতি)
৩১। লুকমান (একজন জ্ঞানী ব্যাক্তি)
৩২। আস-সাজদাহ (সিজদা)
৩৩। আল-আহযাব (জোট)
৩৪। আস-সাবা (রানী সাবা/শেবা)
৩৫। আল-ফাতির (আদি স্রষ্টা)
৩৬। ইয়া সিন (ইয়াসিন)
৩৭। আস-সাফফাত (সারিবদ্ধভাবে দাড়ানো)
৩৮। সোয়াদ (আরবি বর্ণ)
৩৯। আয-যুমার (দল-বদ্ধ জনতা)
৪০। আল-মুমিন (বিশ্বাসী)
৪১। হামিম সাজদাহ (সুস্পষ্ট বিবরণ)
৪২। আশ-শূরা (পরামর্শ)
৪৩। আয-যুখরুফ (সোনাদানা)
৪৪। আদ-দুখান (ধোয়া , smoke)
৪৫। আল-জাসিয়াহ (নতজানু)
৪৬। আল-আহকাফ (বালুর পাহাড়)
৪৭। মুহাম্মদ [নবী মুহাম্মদ স:]
৪৮। আল-ফাতহ (বিজয়)
৪৯। আল-হুজুরাত (বাসগৃহসমুহ)
৫০। ক্বাফ (আরবি বর্ণ)
৫১। আয-যারিয়াত (বিক্ষেপকারী বাতাস)
৫২। আত-তুর (একটি পাহাড়ের নাম)
৫৩। আন-নাজম (তারা)
৫৪। আল-ক্বমর (চন্দ্র)
৫৫। আর-রাহমান (পরম করুণাময়)
৫৬। আল-ওয়াকিয়াহ (নিশ্চিত ঘটনা)
৫৭। আল-হাদিদ (লোহা)
৫৮। আল-মুজাদিলাহ (অনুযোগকারিণী)
৫৯। আল-হাশর (সমাবেশ)
৬০। আল-মুমতাহানা (নারী যাকে পরিক্ষা করা হবে)
৬১। আস-সাফ (সারবন্দী সৈন্যদল)
৬২। আল-জুমুআহ (সম্মেলন/শুক্রবার)
৬৩। আল-মুনাফিকুন (কপট বিশ্বাসীগণ)
৬৪। আত-তাগাবুন (মোহ অপসারণ)
৬৫। আত-ত্বালাক (তালাক)
৬৬। আত-তাহরীম (নিষিদ্ধকরণ)
৬৭। আল-মুলক (সার্বভৌম কতৃত্ব)
৬৮। আল-ক্বলম (কলম)
৬৯। আল-হাক্ক্বাহ (নিশ্চিত সত্য)
৭০। আল-মাআরিজ (উন্নয়নের সোপান)
৭১। নূহ (একজন নবী)
৭২। আল-জ্বিন (জ্বিন সম্প্রদায়)
৭৩। মুযাম্মিল (বস্ত্রাচ্ছাদনকারী)
৭৪। মুদাসসির (পোশাক পরিহিত)
৭৫। আল-কিয়ামাহ (পুনরু্ত্তান)
৭৬। আল-ইনসান (মানুষ)
৭৭। আল-মুরসালাত (প্রেরিত পুরুষগণ)
৭৮। আন-নাবা (মহাসংবাদ)
৭৯। আন-নাযিয়াত (প্রচেষ্টাকারী)
৮০। আবাসা (তিনি ভ্রুকুটি করলেন)
৮১। আত-তাকবির (অন্ধকারাচ্ছন্ন)
৮২। আল-ইনফিতার (বিদীর্ণ করা)
৮৩। আত-তাতফিক (প্রতারণা করা)
৮৪। আল-ইনশিকাক (খন্ড-বিখন্ড করণ)
৮৫। আল-বুরুজ (নক্ষত্রপুন্জ)
৮৬। আত-তারিক (রাতের আগন্তুক)
৮৭। আল-আলা (সর্বোন্নত)
৮৮। আল-গাশিয়াহ (বিহ্বলকর ঘটনা)
৮৯। আল-ফজর (ভোরবেলা)
৯০। আল-বালাদ (নগর)
৯১। আশ-শামস (সূর্য)
৯২। আল-লাইল (রাত্রি)
৯৩। আদ-দুহা (পূর্বান্হের সুর্যকিরণ)
৯৪। আল-ইনশিরাহ (প্রশস্তকরণ)
৯৫। আত-তীন (ডুমুর)
৯৬। আল-আলাক (রক্তপিন্ড)
৯৭। আল-ক্বাদর (মহিমান্বিত)
৯৮। আল-বাইয়িনাহ (সুস্পষ্ট প্রমাণ)
৯৯। আল-যিলযাল (ভূমিকম্প)
১০০। আল-আদিয়াত (অভিযানকারী)
১০১। আল-কারিয়াহ (মহাসংকট)
১০২। আত-তাকাছুর (প্রাচুর্যের প্রতিযোগিতা)
১০৩। আল-আসর (সময়)
১০৪। আল-হুমাযাহ (পরনিন্দাকারী)
১০৫। ফীল (হাতি)
১০৬। আল-কুরাইশ (কুরাইশ গোত্র)
১০৭। আল-মাউন (সাহায্য-সহায়তা)
১০৮। আল-কাওসার (প্রাচুর্য)
১০৯। আল-কাফিরুন (অবিশ্বাসী গোষ্ঠী)
১১০। আন-নাসর (স্বর্গীয় সাহায্য)
১১১। লাহাব (জ্বলন্ত অংগার)
১১২। আল-ইখলাস (একত্ব)
১১৩। আল-ফালাক (নিশিভোর)
১১৪। আন-নাস (মানবজাতি)`


    let surahs = names.split("\n").map((d, index) => ({
        id: index + 1,
        no: d.split("। ")[0],
        name: d.split("। ")[1],
    }))

    for (let surah of surahs) {
        let id = surah.id
        let file_names = []
        let verses = await getData(id)
        for(let i = 0; i < verses.length; i++) {
            let name = `/surah/surah-${id}-${i+1}.json`
            file_names.push(name)
            await fs.writeFile('./public' + name, JSON.stringify(verses[i]), (err) => {
                console.log(err)

            });

        }
        surah.files = file_names
        console.log(`Done ${id}`)
    }

    await fs.writeFile('./public/surah.json', JSON.stringify(surahs), () => {

    });


})()